;Р›Р°Р±.в„– 5
;РќР°РґРёСЂСЏРЅ Р“.Рћ.
#include<p16f84a.inc>
A equ .11 ;.number - dec number
M equ .176
k1 equ .480
k2 equ .0
	ORG 0 ;pic16f84 - 0 (С‚РѕС‡РєР° РІС…РѕРґР°)РєРѕРЅС‚СЂ...pic 16056 - (С‚РѕС‡РєР° РІС…РѕРґР°) 3ff
	call proc1
	call proc2
	call proc3
	org 0x112; СЂРѕР·РјС–СЃС‚РёС‚Рё РІ РЅСѓР»СЊРѕРІС–Р№ СЃС‚РѕСЂС–РЅС†С– РїР°Рј'СЏС‚С– РїСЂРѕРіСЂР°Рј Р·Р° Р°РґСЂРµСЃРѕСЋ РђС– = NС– + 100 (NС– - РЅРѕРјРµСЂ Р·Р° СЃРїРёСЃРєРѕРј Сѓ Р¶СѓСЂРЅР°Р»С– РіСЂСѓРїРё) РїС–РґРїСЂРѕРіСЂР°РјСѓ, С‰Рѕ РІРёРєРѕРЅСѓС” Р·Р°РїРёСЃ РєРѕРЅСЃС‚Р°РЅС‚Рё Рњ Сѓ РєРѕРјС–СЂРєСѓ РїР°РјвЂ™СЏС‚С– РґР°РЅРёС… Рђ
proc1
	movlw M
	movlw M;mov - РїРµСЂРµСЃС‹Р»РєР°,l - Р»РёС‚РµСЂР°Р»,w - СЂРµРіРёСЃС‚СЂ Р°РєРєСѓРјСѓР»СЏС‚РѕСЂ.С‚.Рµ. РїРµСЂРµСЃС‹Р»РєР° Р»РёС‚РµСЂР°Р»Р° РІ Р°РєРєСѓРјСѓР»СЏС‚РѕСЂ,do 255
	movwf A;f - РїРµСЂРµСЃС‹Р»РєР° РІ С„Р°Р№Р» СЂРµРіРёСЃС‚СЂ M do 60-80
	;nop
	;goto $-1 ;РјРµС‚РєР° РІ РІРёРґРµ С‚РµРєСѓС‰РµРіРѕ Р°РґСЂРµСЃР°,РїРµСЂРµС…РѕРґ РЅР° nop.
	return
proc2
	movlw 0x02;Р·Р°РїРёСЃ СЃС‚Р°СЂС€РёС… СЂРѕР·СЂСЏРґС–РІ Р°РґРµСЂСЃРё
	movwf PCLATH;
	movlw 0x12
	movwf PCL;
	org 0x212
	movlw 0xFF;
	tris PORTB; РЅР°СЃС‚СЂРѕСЋРІР°РЅРЅСЏ РїРѕСЂС‚Сѓ Р’ РЅР° РІРІС–Рґ
	movlw 0x00;
	tris PORTA; РЅР°СЃС‚СЂРѕСЋРІР°РЅРЅСЏ РїРѕСЂС‚Сѓ A РЅР° РІРІС–Рґ
	movf PORTB,0; С‡РёС‚Р°РЅРЅСЏ РїРѕСЂС‚Сѓ Р’ Сѓ Р°РєСѓРјСѓР»СЏС‚РѕСЂ
	movwf A; Р·Р°РїРёСЃ С–Р· Р°РєСѓРјСѓР»СЏС‚РѕСЂР° Сѓ РїР°РјвЂ™СЏС‚СЊ РґР°РЅРёС…
	movwf PORTA; РІРёРІС–Рґ Сѓ РїРѕСЂС‚ Рђ РјРѕР»РѕРґС€РѕС— С‚РµС‚СЂР°РґРё,
	swapf A,0; РѕР±РјС–РЅ С‚РµС‚СЂР°Рґ Сѓ РєРѕРјС–СЂС†С– РїР°Рј'СЏС‚С– Рђ, СЂРµР·СѓР»СЊС‚Р°С‚; Р±СѓРґРµ РїРѕРјС–С‰РµРЅРёР№ РІ Р°РєСѓРјСѓР»СЏС‚РѕСЂ (W)
	movwf PORTA; РІРёРІС–Рґ Сѓ РїРѕСЂС‚ Рђ СЃС‚Р°СЂС€РѕС— С‚РµС‚СЂР°РґРё
;loop goto loop ; РѕСЃС‚Р°РЅРѕРІ РїСЂРѕРіСЂР°РјРё
	return
	org 0x312
proc3
	movlw b'00101000' ;переддільника з коефіцієнтом розподілу
	OPTION
	movlw 0x00 ;всі розряді на ввід
	TRIS PORTB ;настроювання порта B на вивід
	movlw 0xff ;всі розряді на вивід
	TRIS PORTA ;настроювання порта А на ввід
start movlw .256-k1 ;формування константи для скидання таймера
	movwf TMR0 ;ініціалізаії таймера
	bcf INTCON,T0IF ;скидання прпорця переповненння таймера 
M1	btfss INTCON,T0IF ;очікування переповнення таймера
	goto M1; перехід, якщо таймер не переповнений
	bcf PORTB,4 ;установка початкового рівня вихідного сигналу
	movlw .256-k2
	movwf TMR0 ;ініціалізаії таймера
	bcf INTCON,T0IF
M2 	btfss INTCON,T0IF ;очікування переповнення таймера
	goto M2 ; перехід, якщо таймер не переповнений
	bsf PORTB,0
	movlw .256-k2
	movfw TMR0
	bcf INTCON,T0IF
	goto start
	end